In [14]:
import numpy as np
import pandas as pd
import datetime

In [3]:
stores = pd.read_csv('D:/SampleData/stores_new.csv')

Convert the data from str / object type to Datetime64, Timestamp, datetime.date
    pd.to_datetime( str = , format = )
    datetime.datetime.strptime()
    pd.Timestamp.strptime() -- not in use anymore

Format the datetime objects as strings
    .strftime( format )
    
Getting the individual dateparts from date/time
    pd.Timestamp()
    datetime.datetime()

Get the date/time from individual dateparts
    .year
    .month
    .day
    .hour
    .minute
    .second
    
Datediff
    d1 - d2
    
    #of days in the output; but in python you will get timedelta object
    timedelta( days = , hours = , minutes = , seconds = )
    
    d1.year - d2.year 

Dateadd
    To get the past or the future date from the given date
    
    date + pd.DateOffset( )

In [6]:
sys_date1 = pd.Timestamp.now()
sys_date2 = '04-06-2022'

In [11]:
print(dir(sys_date1))

['__add__', '__array_priority__', '__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__pyx_vtable__', '__radd__', '__reduce__', '__reduce_cython__', '__reduce_ex__', '__repr__', '__rsub__', '__setattr__', '__setstate__', '__setstate_cython__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__weakref__', '_date_repr', '_repr_base', '_round', '_short_repr', '_time_repr', 'asm8', 'astimezone', 'ceil', 'combine', 'ctime', 'date', 'day', 'day_name', 'day_of_week', 'day_of_year', 'dayofweek', 'dayofyear', 'days_in_month', 'daysinmonth', 'dst', 'floor', 'fold', 'freq', 'freqstr', 'fromisocalendar', 'fromisoformat', 'fromordinal', 'fromtimestamp', 'hour', 'is_leap_year', 'is_month_end', 'is_month_start', 'is_quarter_end', 'is_quarter_start', 'is_year_end', 'is_year_start', 'isocalendar', 'isoformat', 'isoweekday', 'max', 'microsecond', 'min', 'minute', 'month', 'month_name', 'nanosecond', 'normalize', 'now', 'quarter', 'replace', 'resolution', 'round', 'second', 'strftime', 'strptime', 'time', 'timestamp', 'timetuple', 'timetz', 'to_datetime64', 'to_julian_date', 'to_numpy', 'to_period', 'to_pydatetime', 'today', 'toordinal', 'tz', 'tz_convert', 'tz_localize', 'tzinfo', 'tzname', 'utcfromtimestamp', 'utcnow', 'utcoffset', 'utctimetuple', 'value', 'week', 'weekday', 'weekofyear', 'year']

In [10]:
sys_date1.month

6

In [8]:
sys_date2

'04-06-2022'

In [12]:
print(dir(sys_date2))

['__add__', '__class__', '__contains__', '__delattr__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__getitem__', '__getnewargs__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__iter__', '__le__', '__len__', '__lt__', '__mod__', '__mul__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__rmod__', '__rmul__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', 'capitalize', 'casefold', 'center', 'count', 'encode', 'endswith', 'expandtabs', 'find', 'format', 'format_map', 'index', 'isalnum', 'isalpha', 'isascii', 'isdecimal', 'isdigit', 'isidentifier', 'islower', 'isnumeric', 'isprintable', 'isspace', 'istitle', 'isupper', 'join', 'ljust', 'lower', 'lstrip', 'maketrans', 'partition', 'replace', 'rfind', 'rindex', 'rjust', 'rpartition', 'rsplit', 'rstrip', 'split', 'splitlines', 'startswith', 'strip', 'swapcase', 'title', 'translate', 'upper', 'zfill']

In [13]:
pd.to_datetime( sys_date2, format = '%d-%m-%Y' )

Timestamp('2022-06-04 00:00:00')

In [17]:
datetime.datetime.strptime( sys_date2, '%d-%m-%Y' )

datetime.datetime(2022, 6, 4, 0, 0)

In [19]:
pd.Timestamp.strptime( sys_date2, '%d-%m-%Y' )    
#This is Not in use anymore, instead use pd.to_datetime()

NotImplementedError: Timestamp.strptime() is not implemented. Use to_datetime() to parse date strings.

In [22]:
# show this date as mmmm dd, yyyy
sys_date1.strftime('%B %d, %Y')

'June 04, 2022'

In [ ]:
# get the DOB from the user at runtime and display it in weekday - dd mmm yy
dob = input('Enter your DOB (dd/mm/yy): ')
datetime.datetime.strptime( dob, '%d/%m/%Y' ).strftime( '%A - %d %b %y' ) 
#formatting karayla aplyala pahila te date type madhe pahije asta so apan te  kela pahila ani nantr m strftime vaprun formatting keli ani te string banla last la.

Enter your DOB (dd/mm/yy): 24/06/2005

'Friday - 24 Jun 05'

In [37]:
pd.Timestamp( year = 2001, month = 12, day = 30,  )

Timestamp('2001-12-30 00:00:00')

In [ ]:
datetime.datetime( year = 2001, month = 12, day = 30 )

datetime.datetime(2001, 12, 30, 0, 0)

In [ ]:
sys_date1.strftime('%Y - %B')
#he date madhun date part kadhaysathi.

'2022 - June'

In [ ]:
sys_date1.year
#he use karnyapeksha kadhipn te varch wala kela pahije
# yacha output numbers madhe yenar ani (sys_date1.strftime('%Y - %B') yach string

2022

In [39]:
dob

'24/06/2005'

In [41]:
# get the DOB from the user at runtime and display the age of the person
dob = input('Enter your DOB (dd/mm/yy): ')

Enter your DOB (dd/mm/yy): 20/06/2004

6558

In [43]:
(pd.Timestamp.today() - datetime.datetime.strptime( dob, '%d/%m/%Y' )).days / 365.25

17.95482546201232

In [45]:
pd.Timestamp.today().year - datetime.datetime.strptime( dob, '%d/%m/%Y' ).year

18

In [50]:
# get the date which is 2 months, 3 days from current system date
pd.Timestamp.now() + pd.DateOffset( month = 2, day = 3 )

Timestamp('2022-02-03 11:16:28.906859')

In [51]:
s1 = pd.Series(['12594011302002', '15334010312009', '01045902282000'])

In [52]:
s1

0    12594011302002
1    15334010312009
2    01045902282000
dtype: object

In [53]:
pd.to_datetime( s1, format = '%H%M%S%m%d%Y' )

0   2002-11-30 12:59:40
1   2009-10-31 15:33:40
2   2000-02-28 01:04:59
dtype: datetime64[ns]

In [63]:
s2 = pd.Series(['12594011302002am', '09334010312009pm', '01045902282000am'])

In [64]:
s2

0    12594011302002am
1    09334010312009pm
2    01045902282000am
dtype: object

In [68]:
pd.to_datetime( s2, format = '%I%M%S%m%d%Y%p' ).dt.strftime('%A')

0    Saturday
1    Saturday
2      Monday
dtype: object

In [71]:
pd.to_datetime( s2, format = '%I%M%S%m%d%Y%p' ).dt.year

0    2002
1    2009
2    2000
dtype: int64

In [74]:
pd.to_datetime( s2, format = '%I%M%S%m%d%Y%p' ) + pd.DateOffset( day = 31 )

0   2002-11-30 00:59:40
1   2009-10-31 21:33:40
2   2000-02-29 01:04:59
dtype: datetime64[ns]

### .apply() and .applymap() methods

lambda functions: temp single lined functions

map() and filter()

In [ ]:
Series:
    .apply() will iterate on the VALUES of the series

DataFrame:
    .apply( axis = ) will iterate on Series of the DataFrame
    .applymap() will iterate on the VALUES of the DataFrame

#### Get the varible of specific type

To perform conditional subsetting

Method 1:
stores.loc[:, stores.dtypes == 'object' ]

Method 2:
stores.select_dtypes( include = , exclude = )

In [76]:
# Convert the values of Location into upper case

In [78]:
# Method 1: Using str (type conversion)
stores.Location.str.upper().head(2)

0    DELHI
1    DELHI
Name: Location, dtype: object

In [81]:
# Method 2: Using map()
pd.Series( map( lambda x: x.upper(), stores.Location ) ).head(2)

0    DELHI
1    DELHI
dtype: object

In [83]:
# Method 3: Using .apply()
stores.Location.apply( lambda x: x.upper() ).head(2)

0    DELHI
1    DELHI
Name: Location, dtype: object

In [85]:
stores.Location.count()

32

In [86]:
# Convert all the object columns of stores into upper case
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   StoreCode        32 non-null     object
 1   StoreName        32 non-null     object
 2   StoreType        32 non-null     object
 3   Location         32 non-null     object
 4   OperatingCost    32 non-null     float64
 5   Staff_Cnt        32 non-null     int64
 6   TotalSales       32 non-null     float64
 7   Total_Customers  32 non-null     int64
 8   AcqCostPercust   29 non-null     float64
 9   BasketSize       32 non-null     float64
 10  ProfitPercust    32 non-null     float64
 11  Dummy            0 non-null      float64
 12  OwnStore         32 non-null     int64
 13  OnlinePresence   32 non-null     int64
 14  Tenure           32 non-null     int64
 15  StoreSegment     32 non-null     int64
dtypes: float64(6), int64(6), object(4)
memory usage: 4.1+ KB

In [95]:
stores.loc[:, stores.dtypes == 'object' ].head(2)

  StoreCode         StoreName     StoreType Location
0    STR101  Electronics Zone  Electronincs    Delhi
1    STR102      Apparel Zone       Apparel    Delhi

In [96]:
stores.loc[:, stores.dtypes == 'object' ].applymap( lambda x: x.upper() ).head(2)

  StoreCode         StoreName     StoreType Location
0    STR101  ELECTRONICS ZONE  ELECTRONINCS    DELHI
1    STR102      APPAREL ZONE       APPAREL    DELHI

In [98]:
stores.loc[:, stores.dtypes == 'object' ].apply( lambda x: x.str.upper() ).head(2)

  StoreCode         StoreName     StoreType Location
0    STR101  ELECTRONICS ZONE  ELECTRONINCS    DELHI
1    STR102      APPAREL ZONE       APPAREL    DELHI

In [105]:
stores.select_dtypes( exclude = ['int64'] ).head(2)

,StoreCode,StoreName,StoreType,Location,OperatingCost,TotalSales,AcqCostPercust,BasketSize,ProfitPercust,Dummy
0,STR101,Electronics Zone,Electronincs,Delhi,21.0,160.0,3.9,2.620,16.46,NaN
1,STR102,Apparel Zone,Apparel,Delhi,21.0,160.0,3.9,2.875,17.02,NaN

### get the descriptives

In [109]:
stores.describe( include = 'object' ).T

          count unique           top freq
StoreCode    32     32        STR127    1
StoreName    32      7  Apparel Zone    8
StoreType    32      3  Super Market   12
Location     32      4       Chennai    8

In [110]:
stores.describe?

In [111]:
# get the sum of TotalSales
stores.TotalSales.sum()

7383.099999999999

In [112]:
# get me the sum of all float type variables
stores.select_dtypes('float').sum()

OperatingCost      642.900
TotalSales        7383.100
AcqCostPercust     105.880
BasketSize         102.952
ProfitPercust      571.160
Dummy                0.000
dtype: float64

In [114]:
# get me the sum and mean of all float type variables
stores.select_dtypes('float').agg(['sum', 'mean']).T

                     sum        mean
OperatingCost    642.900   20.090625
TotalSales      7383.100  230.721875
AcqCostPercust   105.880    3.651034
BasketSize       102.952    3.217250
ProfitPercust    571.160   17.848750
Dummy              0.000         NaN

In [115]:
# get me the sum, mean, min, max, p1, p5, p10, p25, p50, p75, p90, p95, p99, std, var, 
# cardinality, #nmiss, %miss, uc, lc with iqr of all float type variables

In [135]:
# write a UDF to caluclate the sum and mean of the series object
def fn_descriptive( x ):
    
    # missing values calculation
    ntot = x.shape[0]
    n = x.count()
    nmiss = ntot - n
    nmiss_perc = nmiss/ntot
    
    # get the lc and uc using IQR
    q1 = x.quantile(0.25)
    q3 = x.quantile(0.75)
    IQR =  q3 - q1
    lc_iqr = q1 - 1.5 * IQR
    uc_iqr = q3 + 1.5 * IQR
    
    # return the descripitves
    return pd.Series( [x.dtype, x.nunique(), 
                       ntot, n, nmiss, nmiss_perc,
                       IQR, lc_iqr, uc_iqr, 
                       x.sum(), x.mean(), x.var(), x.std(), 
                       x.min(),
                       x.quantile(0.01), x.quantile(0.05), x.quantile(0.10), 
                       x.quantile(0.25), x.quantile(0.5), x.quantile(0.75), 
                       x.quantile(0.90), x.quantile(0.95), x.quantile(0.99),
                       x.max()], 
                    index = ['dtype', 'cardinality',
                             'ntot', 'n', 'nmiss', 'nmiss_perc', 
                             'IQR', 'lc_iqr', 'uc_iqr', 
                             'sum', 'mean', 'var', 'std', 
                             'min', 
                             'p1', 'p5', 'p10',
                             'p25', 'p50', 'p75', 
                             'p90', 'p95', 'p99',
                             'max'])

In [122]:
fn_descriptive( stores.TotalSales )

sum     7383.100000
mean     230.721875
dtype: float64

In [136]:
stores.select_dtypes(['float', np.int64]).apply( lambda x: fn_descriptive(x) )

,OperatingCost,Staff_Cnt,TotalSales,Total_Customers,AcqCostPercust,BasketSize,ProfitPercust,Dummy,OwnStore,OnlinePresence,Tenure,StoreSegment
dtype,float64,int64,float64,int64,float64,float64,float64,float64,int64,int64,int64,int64
cardinality,25,3,27,22,21,29,30,0,2,2,3,4
ntot,32,32,32,32,32,32,32,32,32,32,32,32
n,32,32,32,32,29,32,32,0,32,32,32,32
nmiss,0,0,0,0,3,0,0,32,0,0,0,0
nmiss_perc,0.0,0.0,0.0,0.0,0.09375,0.0,0.0,1.0,0.0,0.0,0.0,0.0
IQR,7.375,40.0,205.175,83.5,0.77,1.02875,2.0075,NaN,1.0,1.0,1.0,2.0
lc_iqr,4.3625,-20.0,-186.9375,-28.75,1.995,1.038125,13.88125,NaN,-1.5,-1.5,1.5,-1.0
uc_iqr,33.8625,140.0,633.7625,305.25,5.075,5.153125,21.91125,NaN,2.5,2.5,5.5,7.0
sum,642.9,1980,7383.1,4694,105.88,102.952,571.16,0.0,14,13,118,84
mean,20.090625,61.875,230.721875,146.6875,3.651034,3.21725,17.84875,NaN,0.4375,0.40625,3.6875,2.625
var,36.324103,318.951613,15360.799829,4700.866935,0.283731,0.957379,3.193166,NaN,0.254032,0.248992,0.544355,1.467742
std,6.026948,17.859216,123.938694,68.562868,0.532664,0.978457,1.786943,NaN,0.504016,0.498991,0.737804,1.211504
min,10.4,40,71.1,52,2.76,1.513,14.5,NaN,0,0,3,1
p1,10.4,40.0,72.526,55.1,2.76,1.54462,14.531,NaN,0.0,0.0,3.0,1.0
p5,11.995,40.0,77.35,63.65,2.828,1.736,15.0455,NaN,0.0,0.0,3.0,1.0
p10,14.34,40.0,80.61,66.0,2.986,1.9555,15.534,NaN,0.0,0.0,3.0,1.0
p25,15.425,40.0,120.825,96.5,3.15,2.58125,16.8925,NaN,0.0,0.0,3.0,2.0
p50,19.2,60.0,196.3,123.0,3.73,3.325,17.71,NaN,0.0,0.0,4.0,2.0
p75,22.8,80.0,326.0,180.0,3.92,3.61,18.9,NaN,1.0,1.0,4.0,4.0
p90,30.09,80.0,396.0,243.5,4.22,4.0475,19.99,NaN,1.0,1.0,5.0,4.0
p95,31.3,80.0,449.0,253.55,4.346,5.29275,20.1045,NaN,1.0,1.0,5.0,4.0
p99,33.435,80.0,468.28,312.99,4.79,5.39951,22.0692,NaN,1.0,1.0,5.0,4.0
max,33.9,80,472.0,335,4.93,5.424,22.9,NaN,1,1,5,4

In [126]:
stores.select_dtypes('float').apply( fn_descriptive ).T

                     sum        mean
OperatingCost    642.900   20.090625
TotalSales      7383.100  230.721875
AcqCostPercust   105.880    3.651034
BasketSize       102.952    3.217250
ProfitPercust    571.160   17.848750
Dummy              0.000         NaN

### np.where()

In [139]:
stores['Discount'] = pd.Series( np.where( stores.Total_Customers > stores.Total_Customers.mean(), 
                             stores.TotalSales * 0.1, stores.TotalSales * 0.05 ))

In [141]:
stores.head(2)

,StoreCode,StoreName,StoreType,Location,OperatingCost,Staff_Cnt,TotalSales,Total_Customers,AcqCostPercust,BasketSize,ProfitPercust,Dummy,OwnStore,OnlinePresence,Tenure,StoreSegment,Discount
0,STR101,Electronics Zone,Electronincs,Delhi,21.0,60,160.0,110,3.9,2.620,16.46,NaN,0,1,4,4,8.0
1,STR102,Apparel Zone,Apparel,Delhi,21.0,60,160.0,110,3.9,2.875,17.02,NaN,0,1,4,4,8.0

### Charts

boxplot, histogram,
line, area, column, bar : clustered, stacked, 100% stacked
pie, doughnut,
scatter plot
heat map

candle stick,
pareto,
tree map, word clouds, bubble
waterfall

*******************************************************************
Types of variable?
categorical: nominal and ordinal
continuous

Type of analysis?
uni-variate: one variable analysis
bi-variate: two varaible analysis
multi-variate: GT 2 varibles

Why to create charts in data science?
1. Distributions
2. Comparisions
3. Composition / Proportion 
4. Relationships

Analysis....
uni-variate: one variable analysis
    categorical:
        Distributions: freqplot / countplots, word clouds
        Composition: pie, doughnut, 100% stacked charts
        
    continuous:
        Distributions: hist, boxplot

bi-variate: two varaible analysis
    categorical, categorical
        Relationships: crosstab, heatmaps
        
    continuous, continuous
        Relationships: scatter plot / xy plot
        
    categorical, continuous
        Comparisions: line, area, column, bar
        Composition: pie, doughnut, 100% stacked charts

multi variable
        Comparisions: line, area, column, bar

In [143]:
s1.index

RangeIndex(start=0, stop=3, step=1)

In [147]:
len(s1.values)

3

In [153]:
a=('at_home',)
(map(lambda x: x.upper(), a))

In [152]:
a.upper()

AttributeError: 'tuple' object has no attribute 'upper'